float q[][]=new float[4][2];//quad[вершины(4 угла)][координаты (x,y)]
float p[]=new float[2];//точка[координаты (x,y)]

//остальные не важные
float xc, yc, sz;
int ctrl=4;

void setup()
{
  xc=width/2;
  yc=height/2;
  sz=width/100;
  q[0][0]=xc-sz*20;
  q[0][1]=yc-sz*30;
  q[1][0]=xc+sz*30;
  q[1][1]=yc-sz*20;
  q[2][0]=xc+sz*20;
  q[2][1]=yc+sz*30;
  q[3][0]=xc-sz*30;
  q[3][1]=yc+sz*20;
  p[0]=random(width);
  p[1]=random(height);
}

void draw()
{
  background(100);
  if(mousePressed)
  {
    if(ctrl>3)
    {
      p[0]=mouseX;
      p[1]=mouseY;
    }
    else
    {
      q[ctrl][0]=mouseX;
      q[ctrl][1]=mouseY;
    }
  }
  
  
  
  //тут как хочешь, так и меняй
  if(
  ((p[0]<q[0][0]+(q[1][0]-q[0][0])*((p[1]-q[0][1])/(q[1][1]-q[0][1])))==(q[2][0]<q[0][0]+(q[1][0]-q[0][0])*((q[2][1]-q[0][1])/(q[1][1]-q[0][1]))))&&
  ((p[0]<q[1][0]+(q[2][0]-q[1][0])*((p[1]-q[1][1])/(q[2][1]-q[1][1])))==(q[3][0]<q[1][0]+(q[2][0]-q[1][0])*((q[3][1]-q[1][1])/(q[2][1]-q[1][1]))))&&
  ((p[0]<q[2][0]+(q[3][0]-q[2][0])*((p[1]-q[2][1])/(q[3][1]-q[2][1])))==(q[0][0]<q[2][0]+(q[3][0]-q[2][0])*((q[0][1]-q[2][1])/(q[3][1]-q[2][1]))))&&
  ((p[0]<q[3][0]+(q[0][0]-q[3][0])*((p[1]-q[3][1])/(q[0][1]-q[3][1])))==(q[1][0]<q[3][0]+(q[0][0]-q[3][0])*((q[1][1]-q[3][1])/(q[0][1]-q[3][1]))))
  )
  fill(250,50,50);
  else
  fill(20,250,50);
  
  
  
  
  quad(q[0][0],q[0][1],q[1][0],q[1][1],q[2][0],q[2][1],q[3][0],q[3][1]);
  fill(0,100,200);
  ellipse(p[0],p[1],sz*4,sz*4);
}

void mousePressed()
{
  for(int i=0;i<4;i++)
  {
    if(dist(mouseX, mouseY, q[i][0],q[i][1])<sz*5)
    {
      ctrl=i;
    }
  }
}

void mouseReleased()
{
  ctrl=4;
}